pipeTurbulentFlow/Processing/tmp/roughnessFlow1/case_3/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    pipe
    {
        // type            nutkWallFunction;
        // value           uniform 0;
        type            nutkRoughWallFunction;
        value           uniform 0;

        Ks              uniform #eval{1e-3 * 5e-3}; // Значение шероховатости в метрах
        Cs              uniform 1.0;   // Константа шероховатости
    }

}


// ************************************************************************* //
